In [7]:
import numpy as np
import pandas as pd

In [8]:
#pandas operations
#conditional selection 
#Access rows & col's
#Add & delete columns
#concatenation merging & joining dataframes 
#handling missing values
#apply()

In [9]:
d={'USN':[100,101,102],
   'Name':['jerry','tom','ramesh'],
   'Mobile':[99,88,77],
   'marks':[30,35,32]
  }

In [10]:
std=pd.DataFrame(d)

In [11]:
std

   USN    Name  Mobile  marks
0  100   jerry      99     30
1  101     tom      88     35
2  102  ramesh      77     32

In [13]:
#access multiple columns
std[['USN','marks']]

   USN  marks
0  100     30
1  101     35
2  102     32

In [14]:
#access rows
std.loc[1]
#returns row

USN       101
Name      tom
Mobile     88
marks      35
Name: 1, dtype: object

In [15]:
#create a dataframe cars having attributes carid, carname

In [1]:
d={'CarId':[100,101,102,104,105],
   'CarName':['alto','nexon','c','d','f'],
  }

In [17]:
std=pd.DataFrame(d)

In [18]:
std

   CarId CarName
0    100    alto
1    101   nexon
2    102       c
3    104       d
4    105       f

In [22]:
d={'CarId':[100,101,102,104,105,6],
   'CarName':['alto','nexon','supra','lambo','mustang',None],
  }

In [24]:
std=pd.DataFrame(d)

In [25]:
std

   CarId  CarName
0    100     alto
1    101    nexon
2    102    supra
3    104    lambo
4    105  mustang
5      6     None

In [26]:
std.iloc[2]

CarId        102
CarName    supra
Name: 2, dtype: object

In [30]:
std

   CarId  CarName
0    100     alto
1    101    nexon
2    102    supra
3    104    lambo
4    105  mustang
5      6     None

In [31]:
d={'USN':[100,101,102],
   'Name':['jerry','tom','ramesh'],
   'Mobile':[99,88,77],
   'marks':[30,35,None]
  }

In [32]:
std=pd.DataFrame(d)

In [33]:
std

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [34]:
std.iloc[2]

USN          102
Name      ramesh
Mobile        77
marks        NaN
Name: 2, dtype: object

In [38]:
#condition selection
std['marks']<35

0     True
1    False
2    False
Name: marks, dtype: bool

In [41]:
#condition selection
newdf=std['marks']<35

In [42]:
std[newdf]['Name']

0    jerry
Name: Name, dtype: object

In [44]:
#multiple conditions
std[(std['Name']=='jerry')
    &(std['marks']>20)]

   USN   Name  Mobile  marks
0  100  jerry      99   30.0

In [45]:
std[(std['USN']>100) | (std['marks']<40)]

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [46]:
std[(std['USN']>100) & (std['marks']<40)]

   USN Name  Mobile  marks
1  101  tom      88   35.0

In [49]:
#adding new column
s='bangalore,delhi,punjab'.split(',')
print(s,type(s))

['bangalore', 'delhi', 'punjab'] <class 'list'>

In [50]:
std['Address']=s

In [51]:
std

   USN    Name  Mobile  marks    Address
0  100   jerry      99   30.0  bangalore
1  101     tom      88   35.0      delhi
2  102  ramesh      77    NaN     punjab

In [54]:
std.drop('Address',axis=1,inplace=True)

In [53]:
std

   USN    Name  Mobile  marks    Address
0  100   jerry      99   30.0  bangalore
1  101     tom      88   35.0      delhi
2  102  ramesh      77    NaN     punjab

In [56]:
std.drop(2)

   USN   Name  Mobile  marks
0  100  jerry      99   30.0
1  101    tom      88   35.0

In [57]:
d2={'USN':[100,101,102],
    'Name':['jerry','nan','simran'],
    'Mobile':[99,88,77],
    'marks':[30,35,None,]
   }

In [58]:
df=pd.DataFrame(d)

In [59]:
std

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [60]:
df.dropna()

   USN   Name  Mobile  marks
0  100  jerry      99   30.0
1  101    tom      88   35.0

In [61]:
d2={'USN':[100,101,102],
    'Name':['jerry','nan','simran'],
    'Mobile':[99,88,77],
    'marks':[30,35,None,]
   }

In [62]:
df=pd.DataFrame(d2)

In [63]:
df

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     nan      88   35.0
2  102  simran      77    NaN

In [65]:
df.dropna(thresh=2)

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     nan      88   35.0
2  102  simran      77    NaN